# Taps

##
# Binaries
##
# brew 'mas' # Mac App Store manager
# brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'pkg-config'
brew 'dockutil'


##
# Development
##
brew 'git'
brew 'go'
brew 'composer'
brew 'mysql'

brew 'node@24'
brew 'nvm'

brew 'neovim'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'lazygit'
brew 'starship'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'docker'
cask 'ghostty'
cask 'herd'
cask 'visual-studio-code'
cask 'tableplus'
cask 'raycast'


##
# Apps
##
cask '1password'
cask 'google-chrome'
cask 'keka'
cask 'spotify'
cask 'signal'
